# Определение персонажей игры.
define e = Character('Незнакомка', color="#291246")
define g = Character('...', color="#581C1C")

# Игра начинается здесь:
label start:
    scene kill
    play sound "scream.mp3"

    g "НЕ НАДО! НЕЕТ!"

    scene black

    g "..."

    scene home

    play sound "dark.mp3"

    #Акт 1. Пробуждение
    #Сцена 1. Первое пробуждение
    #Заброшенный дом в деревне. Полумрак. Герой лежит на кровати, рядом разбросаны медицинские инструменты. В комнате пахнет лекарствами.

    #Герой (приоткрывает глаза, хватается за голову): 
    g "Где я? Что со мной случилось? Почему я ничего не помню?"

    #Незнакомка (входит с чашкой, мягко): 
    show sorry:
        xalign 0.0
        yalign 1.0

    e "Тише, не торопитесь. Выпейте это, вам станет легче."
    
menu:

    "Хорошо.":
        jump choice1_no

    "Нет.":
        jump choice_death

label choice1_no:

    $ menu_flag = False

    jump choice1_done

label choice1_done:

    # ... the game continues here.
 

    #Герой (недоверчиво): 
    g "Кто вы такая? Где моя семья? Что с ними?"

    #Незнакомка: 
    show sorry:
        xalign 0.0
        yalign 1.0

    e "Ваша семья… Они в безопасности. А я — ваш врач, я помогаю вам восстановиться."


    #Герой: 
    g "Восстановить что? Я не понимаю, что происходит!"

    #Незнакомка: 
    show sorry:
        xalign 0.0
        yalign 1.0

    e "Память иногда играет с нами злые шутки. Но мы справимся с этим вместе."


    #Герой: 
    g "Сколько я был без сознания?"

    #Незнакомка: 
    show sorry:
        xalign 0.0
        yalign 1.0

    e "Недолго. Но вам нужно отдохнуть."


    #Герой: 
    g "Почему я не помню ничего? Где мы находимся?"

    #Незнакомка: 
    e "Мы в безопасном месте. Здесь вы сможете восстановить свои воспоминания."

    #Герой: 
    g "А как я сюда попал?"

    #Незнакомка: 
    e "Вы были ранены. Я нашла вас в лесу и привела сюда."

    #Герой: 
    g "Но почему я ничего не помню о том, как оказался в лесу?"

    #Незнакомка: 
    e "Иногда память блокирует травмирующие события. Это защитный механизм."

    #Сцена 2. Первые шаги
    #Герой пытается встать, но Незнакомка помогает ему.

    #Герой: 
    g "Почему у меня такое чувство, что вы что-то скрываете?"

    #Незнакомка: 
    e "Просто ваше состояние нестабильно. Память возвращается постепенно."

    #Герой: 
    g "А что за деревня? Почему она такая заброшенная?"

    #Незнакомка: 
    e "Это старая деревня. Многие уехали. Остались только те, кто не может или не хочет покидать родные места."

    #Герой: 
    g "А вы? Вы местная?"

    #Незнакомка: 
    e "Можно и так сказать. Я здесь живу уже давно."

    #Герой: 
    g "И что, здесь всегда так тихо?"

    #Незнакомка: 
    e "Да, здесь всегда спокойно. Это место помогает исцелиться."


label choice_death:

    scene doctors

    g "Что... происходит..."

    return